# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Sat Aug 06 12:33:09 CDT 2022

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design mult_seq

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 0.006 [get_ports {sum_q[31]}]
set_load -pin_load 0.006 [get_ports {sum_q[30]}]
set_load -pin_load 0.006 [get_ports {sum_q[29]}]
set_load -pin_load 0.006 [get_ports {sum_q[28]}]
set_load -pin_load 0.006 [get_ports {sum_q[27]}]
set_load -pin_load 0.006 [get_ports {sum_q[26]}]
set_load -pin_load 0.006 [get_ports {sum_q[25]}]
set_load -pin_load 0.006 [get_ports {sum_q[24]}]
set_load -pin_load 0.006 [get_ports {sum_q[23]}]
set_load -pin_load 0.006 [get_ports {sum_q[22]}]
set_load -pin_load 0.006 [get_ports {sum_q[21]}]
set_load -pin_load 0.006 [get_ports {sum_q[20]}]
set_load -pin_load 0.006 [get_ports {sum_q[19]}]
set_load -pin_load 0.006 [get_ports {sum_q[18]}]
set_load -pin_load 0.006 [get_ports {sum_q[17]}]
set_load -pin_load 0.006 [get_ports {sum_q[16]}]
set_load -pin_load 0.006 [get_ports {sum_q[15]}]
set_load -pin_load 0.006 [get_ports {sum_q[14]}]
set_load -pin_load 0.006 [get_ports {sum_q[13]}]
set_load -pin_load 0.006 [get_ports {sum_q[12]}]
set_load -pin_load 0.006 [get_ports {sum_q[11]}]
set_load -pin_load 0.006 [get_ports {sum_q[10]}]
set_load -pin_load 0.006 [get_ports {sum_q[9]}]
set_load -pin_load 0.006 [get_ports {sum_q[8]}]
set_load -pin_load 0.006 [get_ports {sum_q[7]}]
set_load -pin_load 0.006 [get_ports {sum_q[6]}]
set_load -pin_load 0.006 [get_ports {sum_q[5]}]
set_load -pin_load 0.006 [get_ports {sum_q[4]}]
set_load -pin_load 0.006 [get_ports {sum_q[3]}]
set_load -pin_load 0.006 [get_ports {sum_q[2]}]
set_load -pin_load 0.006 [get_ports {sum_q[1]}]
set_load -pin_load 0.006 [get_ports {sum_q[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {b[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports en]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {sum_q[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[15]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[14]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[13]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[12]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[11]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[10]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[9]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[8]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[7]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[6]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[5]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[4]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[3]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[2]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[1]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {a[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[15]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[14]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[13]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[12]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[11]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[10]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[9]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[8]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[7]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[6]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[5]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[4]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[3]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[2]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[1]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {b[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports reset]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports en]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 1.0 [get_clocks clk]
set_clock_uncertainty -hold 1.0 [get_clocks clk]
